In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
from getpass import getpass

In [3]:
password = getpass()

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

In [28]:
# 1. How many distinct (different) actors' last names are there?

query_1 = 'SELECT COUNT(DISTINCT(last_name)) as "distinct_last_name" \
FROM sakila.actor;'

print(query_1) # Just testing out the backslash formatting

data = pd.read_sql_query(query_1, engine)
data.head()

SELECT COUNT(DISTINCT(last_name)) as "distinct_last_name" FROM sakila.actor;

   distinct_last_name
0                 121

In [11]:
# 2 Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

query_2 = 'SELECT *, DAYOFWEEK(rental_date), \
    CASE \
WHEN DAYOFWEEK(rental_date) in (2,3,4,5,6) then "workday" \
WHEN DAYOFWEEK(rental_date) in (1,7) then "weekend" \
END AS "day_type" FROM sakila.rental;'

data = pd.read_sql_query(query_2, engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,DAYOFWEEK(rental_date),day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,3,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,3,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,3,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,3,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,3,workday

In [30]:
# 3. Get all films with ARMAGEDDON in the title.

query_3 = 'SELECT title \
FROM sakila.film \
WHERE title LIKE "%%ARMAGEDDON%%"'

data = pd.read_sql_query(query_3, engine)
data.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

In [36]:
# 4. Get 10 the longest films.

query_4 = 'SELECT title, length FROM sakila.film \
ORDER BY length DESC \
LIMIT 10;'

data = pd.read_sql_query(query_4, engine)
data.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [35]:
# 5. How many films include Behind the Scenes content?

query_5 = 'SELECT COUNT(DISTINCT IF(special_features LIKE "%%Behind the Scenes%%", film_id, NULL)) AS "Behind_the_Scenes" \
    FROM sakila.film;'

print(query_5)

data = pd.read_sql_query(query_5, engine)
data.head()

SELECT COUNT(DISTINCT IF(special_features LIKE "%%Behind the Scenes%%", film_id, NULL)) AS "Behind_the_Scenes"     FROM sakila.film;

   Behind_the_Scenes
0                538

In [26]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

query_6 = 'SELECT rating, AVG(length) \
FROM sakila.film \
GROUP BY rating \
HAVING AVG(length) > 120;'

data = pd.read_sql_query(query_6, engine)
data.head()

  rating  AVG(length)
0  PG-13     120.4439

In [27]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

query_7 = 'SELECT length, title, RANK() OVER(ORDER BY length DESC) AS "rank" \
FROM sakila.film \
WHERE length != "" AND length is NOT NULL;'

data = pd.read_sql_query(query_7, engine)
data.head()

   length           title  rank
0     185   CHICAGO NORTH     1
1     185  CONTROL ANTHEM     1
2     185  DARN FORRESTER     1
3     185     GANGS PRIDE     1
4     185       HOME PITY     1

In [ ]:
# END OF LAB 2.9 #